load-test/artillery.yml

# ============================================================
# Artillery Load Test — Flash Sale Engine
# Day 6: Stress Testing & Observability
#
# INTERVIEW EXPLANATION:
# We ramp from 100 req/s to 1000 req/s to mimic a real flash
# sale scenario (sudden surge of buyers). This proves our system
# doesn't degrade under load.
# ============================================================

config:
  target: "http://localhost:3000"  # Our Express server
  phases:
    # Create 100 virtual users over 10 seconds.
    # Each virtual user will then loop 1000 times, sending a total of 100,000 requests.
    # This prevents Windows from running out of network sockets (EADDRINUSE).
    - duration: 10
      arrivalRate: 10
      name: "Massive Distributed Load (100k requests)"

  # Artillery plugins for enhanced HTML reports
  plugins:
    expect: {}

  # Default headers applied to ALL requests
  defaults:
    headers:
      Content-Type: "application/json"
      # Our new bypass token to fix the 401 Unauthorized errors
      Authorization: "Bearer test-token"

# ============================================================
# SCENARIOS: What each virtual user actually does
# ============================================================
scenarios:
  - name: "Trading Bot"
    flow:
      # We loop 1000 times per virtual user (100 users * 1000 = 100,000 total requests)
      - loop:
          - post:
              url: "/api/order"
              headers:
                # Spoofing the 10 IPs the user requested
                X-Forwarded-For: "192.168.1.{{ $randomNumber(1, 10) }}"
              json:
                side: "BUY"
                type: "LIMIT"
                symbol: "BTC"
                price: "{{ $randomNumber(45000, 50000) }}"
                quantity: "{{ $randomNumber(1, 10) }}"
          - post:
              url: "/api/order"
              headers:
                X-Forwarded-For: "192.168.1.{{ $randomNumber(1, 10) }}"
              json:
                side: "SELL"
                type: "LIMIT"
                symbol: "BTC"
                price: "{{ $randomNumber(45000, 50000) }}"
                quantity: "{{ $randomNumber(1, 10) }}"
          - get:
              url: "/api/order/book?symbol=BTC"
              headers:
                X-Forwarded-For: "192.168.1.{{ $randomNumber(1, 10) }}"
        # The loop runs 334 times * 3 requests = ~1000 requests per user
        count: 334