load-test/artillery.yml

config:
  target: "https://nexustrade-engine.onrender.com"
  http:
    timeout: 30
  phases:
    - duration: 5
      arrivalRate: 20
      name: "Massive Distributed Load (1000 req/sec)"

  plugins:
    expect: {}

  defaults:
    headers:
      Content-Type: "application/json"
      Authorization: "Bearer test-token"

scenarios:
  - name: "Trading Bot"
    flow:
      - loop:
          - post:
              url: "/api/order"
              headers:
                X-Forwarded-For: "192.168.1.{{ $randomNumber(1, 10) }}"
              json:
                side: "BUY"
                type: "LIMIT"
                symbol: "ETH"
                price: "{{ $randomNumber(2500, 3500) }}"
                quantity: "{{ $randomNumber(1, 10) }}"
          - post:
              url: "/api/order"
              headers:
                X-Forwarded-For: "192.168.1.{{ $randomNumber(1, 10) }}"
              json:
                side: "SELL"
                type: "LIMIT"
                symbol: "ETH"
                price: "{{ $randomNumber(2500, 3500) }}"
                quantity: "{{ $randomNumber(1, 10) }}"
          - get:
              url: "/api/order/book?symbol=ETH"
              headers:
                X-Forwarded-For: "192.168.1.{{ $randomNumber(1, 10) }}"
        count: 17